# Longitude Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..Longitude Property
SunAndShadowSettings Class See Also
---
Identifies the current longitude used by the SunAndShadowSettings element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double Longitude { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Longitude As Double
	Get
```

Visual C++
---
```text
public:
property double Longitude {
	double get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace